[
  {
    "title": "Journal of Economic Growth",
    "content": "The Journal of Economic Growth serves as the principal outlet for research in the fields of economic growth and comparative economic development. The journal publishes high quality research that explores the growth process in the contemporary period as well as over the entire course of human history. In particular, the journal encourages the submission of research that explores the role of income distribution, the demographic transition, human capital formation, technological change, and structural transformation in the growth process, as well as the role deeply-rooted geographical, cultural, institutional and human characteristics in the comparative economic development.",
    "tag": "Economics"
  },
  {
    "title": "PharmacoEconomics",
    "content": "PharmacoEconomics is the benchmark journal for peer-reviewed, authoritative and practical articles on the application of pharmacoeconomics and quality-of-life assessment to optimum drug therapy and health outcomes. An invaluable source of applied pharmacoeconomic original research and educational material for the healthcare decision maker",
    "tag": "Economics"
  },
  {
    "title": "Policy Sciences",
    "content": "With an interdisciplinary and international focus, Policy Sciences encourages a diversity of perspectives. The editors especially welcome conceptual and empirical innovation, together with the potential richness and insight of comparative orientation.",
    "tag": "Economics"
  },
  {
    "title": "Transportation",
    "content": "The journal Transportation focuses on issues of relevance to the formulation of policy, the preparation and evaluation of plans, and the day-to-day operational management of transport systems. It concerns itself with the policies and systems themselves, as well as with their impacts on and relationships with other aspects of the social, economic and physical environment",
    "tag": "Economics"
  },
  {
    "title": "The International Journal of Life Cycle Assessment",
    "content": "The International Journal of Life Cycle Assessment (Int J Life Cycle Assess) is the first journal devoted entirely to Life Cycle Assessment and closely related methods. LCA has become a recognized instrument to assess the ecological burdens and impacts throughout the consecutive and interlinked stages of a product system, from raw material acquisition or generation from natural resources, through production and use to final disposal. The Int J Life Cycle Assess is a forum for scientists developing LCA and LCM (Life Cycle Management); LCA and LCM practitioners; managers concerned with environmental aspects of products; governmental environmental agencies responsible for product quality; scientific and industrial societies involved in LCA development, and ecological institutions and bodies",
    "tag": "Economics"
  },
  {
    "title": "Archives of Computational Methods in Engineering",
    "content": "Archives of Computational Methods in Engineering provides an active forum for the dissemination of results in both research and advanced practice in computational engineering, with particular emphasis on mechanics and its related areas. The journal exclusively publishes extended state-of-the-art reviews in selected areas, a unique feature of the journal. Reviews published in the journal not only offer a survey of the current literature, but also a critical exposition of the topic in its full complexity.",
    "tag": "Engineering"
  },
  {
    "title": "Space Science Reviews",
    "content": "As an international key journal on scientific space research, its purpose is to provide a comprehensive synthesis of the various branches of space research. The emphasis is on scientific results and instruments in the fields of astrophysics, physics of planetary systems, solar physics, and physics of magnetospheres & interplanetary matter. Space Science Reviews publishes invited papers and topical volumes, engaging guest editors whose expertise matches the topic at hand",
    "tag": "Engineering"
  },
  {
    "title": "Stem Cell Reviews and Reports",
    "content": "Stem Cell Reviews and Reports (SCRR) covers contemporary and emerging areas in stem cells by publication of reviews, original data reports (full reports and short reports), protocols, novel hypotheses and commentaries. The scope related to stem cells is broad and includes topics in stem cell biology covering basic, clinical, biotechnology, regulatory, and ethical aspects of embryonic and adult stem cells, induced pluripotent stem cells, fate choice, specific lineage and cloning issues, translational studies, and diseases where stem cell anomalies play a key role and related matters. Original articles are expected to provide novel insights based on new data. Reviews, commentaries and hypotheses should provide syntheses of current concepts in the field and discuss emerging issues and controversies; the nature of the topic or idea being discussed will dictate appropriate choice of article type. Protocols will help accelerate studies in the field, by providing practical and step by step descriptions of established or emerging protocols and techniques of utility for both established and novice investigator",
    "tag": "Engineering"
  },
  {
    "title": "Friction",
    "content": "Friction is a single-blind peer-reviewed open access journal published under the SpringerOpen brand for the publication of theoretical and experimental research works related to the friction, lubrication and wear. Original, high quality research papers and review articles on all aspects of tribology are welcome, including, but are not limited to, a variety of topics",
    "tag": "Engineering"
  },
  {
    "title": "Nano-Micro Letters",
    "content": "Nano-Micro Letters is a peer-reviewed, international, interdisciplinary and open-access journal published under the SpringerOpen brand that focus on science, experiments, engineering, technologies and applications of nano- or microscale structure and system in physics, chemistry, biology, material science, pharmacy and their expanding interfaces with at least one dimension ranging from a few sub-nanometers to a few hundreds of micrometers. Especially, emphasize the bottom-up approach in the length scale from nano to micro since the key for nanotechnology to reach industrial applications is to assemble, to modify, and to control nanostructure in micro scale. The aim is to provide a publishing platform crossing the boundaries, from nano to micro, and from science to technologies",
    "tag": "Engineering"
  },
  {
    "title": "Cellular and Molecular Life Sciences",
    "content": "Based in Basel, Switzerland, the multidisciplinary journal Cellular and Molecular Life Sciences (CMLS) publishes research articles, reviews, multi-author reviews and visions & reflections articles covering the latest aspects of biological and biomedical research. The journal will consider contributions focusing on biochemistry and molecular biology, cell biology, molecular and cellular aspects of biomedicine, neuroscience, pharmacology and immunology. In addition, CMLS welcomes comments on any article published in CMLS, as well as suggestions for topics to be covered",
    "tag": "Chemistry"
  },
  {
    "title": "Protein & Cell",
    "content": "Protein & Cell publishes original research articles, reviews, and commentaries concerning the latest developments in multidisciplinary areas in biology and biomedicine, with an emphasis on protein and cell research.",
    "tag": "Chemistry"
  },
  {
    "title": "Nano Research",
    "content": "Nano Research is a peer-reviewed, international and interdisciplinary research journal that focuses on all aspects of nanoscience and nanotechnology. Submissions are solicited in all topical areas, ranging from basic aspects of the science of nanoscale materials to practical applications of such materials. All research results published in Nano Research from 2008 to 2010 are freely available online",
    "tag": "Chemistry"
  },
  {
    "title": "Topics in Current Chemistry",
    "content": "This journal presents critical reviews of present and future trends spanning modern chemical research, including intersections with such disciplines as biology, medicine, physics and materials science. The issues are organized as thematic collections which offer the non-specialist reader in academe or industry a comprehensive perspective on emerging research. Each review article is a critical survey of one aspect of the issue’s topic, which places it in the context of the collection. Selected examples illustrate the most significant developments of the last 5 to 10 years. Rather than attempt an exhaustive summary of the field or include large quantities of data, each article concentrates on the methodological thinking. This allows the non-specialist reader to fully grasp the information, and conveys the prospects of potential developments to come",
    "tag": "Chemistry"
  },
  {
    "title": "Apoptosis",
    "content": "Apoptosis is an international peer-reviewed journal devoted to the rapid publication of innovative basic and clinically-oriented investigations into programmed cell death. It aims to stimulate research on the basis of mechanisms of apoptosis and on its role in various human disease processes including: cancer, autoimmune disease, viral infection, AIDS, cardiovascular disease, neurodegenerative disorders, osteoporosis and ageing. The editors intend to encourage the development of clinical therapies against apoptosis-related diseases",
    "tag": "Chemistry"
  },
  {
    "title": "Theoretical and Applied Genetics",
    "content": "Theoretical and Applied Genetics publishes original research and review articles in all key areas of modern plant genetics, plant genomics and plant biotechnology. All work needs to have a clear genetic component and significant impact on plant breeding. Theoretical considerations are only accepted in combination with new experimental data and/or if they indicate a relevant application in plant genetics or breeding. Emphasizing the practical, the journal focuses on research into leading crop plants and articles presenting innovative approaches",
    "tag": "Chemistry"
  },
  {
    "title": "Phytochemistry Reviews",
    "content": "Phytochemistry Reviews is an international review journal that publishes peer-reviewed papers in six issues annually. The journal examines topical issues, some of which result from meetings organized by the Phytochemical Society of Europe (PSE) and by the Phytochemical Society of North America",
    "tag": "Chemistry"
  }
]